// 为了避免在FireFox中多次运行出现重复定义问题
// 包装开始
(() => {

    // 修改下面的成绩，可以直接从excel复制粘贴，成绩的顺序必须和教务系统的名单一致
    const scoreRaw =
        `221124010014	吴芳	87
221124010062	邹敏	81
221124010105	李昌蔚	92
221124010114	余传奇	92
221124010155	刘长青	83
221124010172	马欢	91
221124010033	罗阿甲	92
221124010138	罗超	92
221124010161	江小朋	98
221124010166	毛呷明	86
221124010174	益西翁扎	81
221124010128	高梓晔	82
221124010147	王尧	95
221124010154	周含鸣	95
221124010167	吴坤生	94
221124010007	王樱蓉	83
221124010049	汪洋	89
221124010050	陈杰	84
221124010090	赵禹辰	81
221124010037	吴星怡	94
221124010064	郑龙	83
221124010111	陈天祺	95
221124010143	刘静	97
221124010148	刘雨煌	81
221124010183	纪垚林	86
221124010184	格桑卓玛	90
221124010035	许越	81
221124010063	刘威	81
221124010091	邓灵	83
221124010135	宋庆	93
221124010140	刘津良	83
221124010134	谯小峰	98
221124010139	陈飞	91
221124010162	王炯炯
221124010182	易小勇	94
221124010003	廖禹婷	87
221124010065	胡开红	98
221124010066	彭凯歌	84
221124010122	何家豪	82
221124010149	马清玲	98
`
    // 分数
    let scores = {}

    // 按行进行切分
    const rows = scoreRaw.split('\n');
    for (const row of rows) {
        const fields = row.split('\t');
        scores[fields[0].trim()] = fields;
    }

    // 找到录入成绩对应的文档
    let doc = document; // 默认为top文档，即当前页面所在的文档
    for (let i = 0; i < frames.length; i++) {
        const d = frames[i].document;
        if (d.title == '教学记录-YETHAN以专教学信息服务平台') {
            doc = d;
            break;
        }
    }

    // 填充到每个输入框
    let ids = doc.getElementsByName('studentId'); // 平时成绩录入时学号
    if (ids.length == 0) {
        ids = doc.getElementsByName('student_id'); // 期末成绩录入时学号
    }
    const marks = doc.getElementsByName('mark');
    for (let i = 0; i < marks.length; i++) {
        const id = ids[i].value
        marks[i].value = scores[id][2].trim();
    }

    // 包装结束
})();
